Конфигурация/Reports/ШахматнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ШахматнаяВедомость</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСубсчетам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьЗабалансовыеСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйРегистр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/Reports/ШахматнаяВедомость/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура("ИспользоватьПередКомпоновкойМакета,
							|ИспользоватьПослеКомпоновкиМакета,
							|ИспользоватьПослеВыводаРезультата,
							|ИспользоватьДанныеРасшифровки,
							|ИспользоватьПередВыводомЭлементаРезультата",
							Истина, Истина, Ложь, Истина, Ложь);
							
КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт 
	
	Возврат "Шахматная ведомость" + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	КомпоновщикНастроек.Настройки.Структура.Очистить();
	КомпоновщикНастроек.Настройки.Выбор.Элементы.Очистить();
	
	КоличествоПоказателей = РаботаСБухгалтерскимиОтчетами.КоличествоПоказателей(ПараметрыОтчета);
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьВыбранноеПоле(КомпоновщикНастроек, "СуммаОборот");
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.СчетДоверительногоУправления) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "СчетДоверительногоУправления", ПараметрыОтчета.СчетДоверительногоУправления,,, Истина);
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ВыводитьЗабалансовыеСчета", ПараметрыОтчета.ВыводитьЗабалансовыеСчета);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПоСубсчетам", ПараметрыОтчета.ПоСубсчетам);
	
	// Формирование структуры отчета
	Таблица = КомпоновщикНастроек.Настройки.Структура.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	ГруппировкаСтрока = Таблица.Строки.Добавить();
	Если ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
		ГруппировкаСтрока.Имя = "СтрокиВалюта";
	КонецЕсли;
	
	ПолеГруппировки = ГруппировкаСтрока.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование  = Истина;
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("СчетДт");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
	ГруппировкаСтрока.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ГруппировкаСтрока.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		
	// Установка отбора на выводимый уровень иерархии счета
	ГруппаЭлементовОтбора = ГруппировкаСтрока.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Иерархия;
	ГруппаЭлементовОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбора, "ПараметрыДанных.ПоСубсчетам", Истина);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбора, "СистемныеПоля.УровеньВГруппировке", 1);
	// Отключим вывод отборов
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(ГруппировкаСтрока, "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	
	Если ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
		ГруппировкаСтрокаВалюта = ГруппировкаСтрока.Структура.Добавить();
		ГруппировкаСтрокаВалюта.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ГруппировкаСтрокаВалюта.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		
		ПолеГруппировки = ГруппировкаСтрокаВалюта.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле          = Новый ПолеКомпоновкиДанных("ВалютаДт"); 
	КонецЕсли;
	
	ГруппировкаКолонка = Таблица.Колонки.Добавить();
	
	Если ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
		ГруппировкаКолонка.Имя = "КолонкиВалюта";
	КонецЕсли;
	
	ПолеГруппировки = ГруппировкаКолонка.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	ПолеГруппировки.Использование  = Истина;
	ПолеГруппировки.Поле           = Новый ПолеКомпоновкиДанных("СчетКт");
	ПолеГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
	ГруппировкаКолонка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	ГруппировкаКолонка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	// Установка отбора на выводимый уровень иерархии счета
	ГруппаЭлементовОтбора = ГруппировкаКолонка.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.Применение = ТипПримененияОтбораКомпоновкиДанных.Иерархия;
	ГруппаЭлементовОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбора, "ПараметрыДанных.ПоСубсчетам", Истина);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбора, "СистемныеПоля.УровеньВГруппировке", 1);
	// Отключим вывод отборов
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(ГруппировкаКолонка, "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	
	Если ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
		ГруппировкаКолонкаВалюта = ГруппировкаКолонка.Структура.Добавить();
		ГруппировкаКолонкаВалюта.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		ГруппировкаКолонкаВалюта.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		
		ПолеГруппировки = ГруппировкаКолонкаВалюта.ПоляГруппировки.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ПолеГруппировки.Использование = Истина;
		ПолеГруппировки.Поле          = Новый ПолеКомпоновкиДанных("ВалютаКт"); 
	КонецЕсли;

	РаботаСБухгалтерскимиОтчетами.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);
	
	// Иванов 2016-08-26...
	Если Схема.НаборыДанных.Найти("ОсновнойНабор") <> Неопределено Тогда 
			
		// Поля
		Схема.НаборыДанных.ОсновнойНабор.Запрос = СтрЗаменить(Схема.НаборыДанных.ОсновнойНабор.Запрос, "ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт,", "");
		Схема.НаборыДанных.ОсновнойНабор.Запрос = СтрЗаменить(Схема.НаборыДанных.ОсновнойНабор.Запрос, "ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт,", "");
		
		
		// Выбор
		Схема.НаборыДанных.ОсновнойНабор.Запрос = СтрЗаменить(Схема.НаборыДанных.ОсновнойНабор.Запрос, "ЛицевойСчетДт.*,", "");
		Схема.НаборыДанных.ОсновнойНабор.Запрос = СтрЗаменить(Схема.НаборыДанных.ОсновнойНабор.Запрос, "ЛицевойСчетКт.*,", "");
		
		Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" Тогда	
			
			Если СтрЧислоВхождений(Схема.НаборыДанных.ОсновнойНабор.Запрос , ПараметрыОтчета.УчетныйРегистр) = 0 Тогда 
				Схема.НаборыДанных.ОсновнойНабор.Запрос = СтрЗаменить(Схема.НаборыДанных.ОсновнойНабор.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
			КонецЕсли;

			Схема.НаборыДанных.ОсновнойНабор.Запрос = 
			СтрЗаменить(Схема.НаборыДанных.ОсновнойНабор.Запрос, "ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт КАК СчетДт," 
														,"ЕдиныйБухгалтерскийУчетОборотыДтКт.СчетДт КАК СчетДт, ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетДт, ЕдиныйБухгалтерскийУчетОборотыДтКт.ЛицевойСчетКт,");
			
														
			Схема.НаборыДанных.ОсновнойНабор.Запрос = 
			СтрЗаменить(Схема.НаборыДанных.ОсновнойНабор.Запрос, "СчетДт.*," 
														,"СчетДт.*, ЛицевойСчетДт.*, ЛицевойСчетКт.*,");
														
		КонецЕсли;
		
	КонецЕсли;
	//... Иванов 2016-08-26 Конец
	
КонецПроцедуры

Процедура ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.УчетныйРегистр) Тогда
		Если ПараметрыОтчета.УчетныйРегистр <> "БухгалтерскийУчет" 
			//Иванов 2016-08-22 Тест запроса для "ЕдиныйБухгалтерскийУчет" изменен ранее .Начало...
			И ПараметрыОтчета.УчетныйРегистр <> "ЕдиныйБухгалтерскийУчет"
			//...Иванов 2016-08-22 Конец
			Тогда
			МакетКомпоновки.НаборыДанных.ОсновнойНабор.Запрос = СтрЗаменить(МакетКомпоновки.НаборыДанных.ОсновнойНабор.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
		КонецЕсли;
	КонецЕсли;
	
	МакетШапкиОтчета = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетШапки(МакетКомпоновки);
	
	Если ПараметрыОтчета.ПоказательВалютнаяСумма Тогда
		Если ТипЗнч(МакетШапкиОтчета) = Тип("ОписаниеМакетаОбластиМакетаКомпоновкиДанных")
			И МакетШапкиОтчета.Макет.Количество() > 1 
			И МакетШапкиОтчета.Макет[1].Ячейки.Количество() > 1 Тогда
			ЭлементыОформленияЯчейки = МакетШапкиОтчета.Макет[1].Ячейки[1].Оформление.Элементы;
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ЭлементыОформленияЯчейки, "ОбъединятьПоВертикали", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("БУ");
	НаборПоказателей.Добавить("ВалютнаяСумма");
	
	Возврат НаборПоказателей;
	
КонецФункции


#КонецЕсли
